{
	"talks": [
		{
			"title": "Intermediate Flask",
			"link": "https://github.com/danrschlosser/intermediate-flask",
			"description": "<p>Written as a natural extension of the my Accelerated Introduction to Web Development talk, this tutorial covers advanced topics in Flask, including building large Flask apps, managing dependencies, using a database, and processing form data.</p>"
		},
		{
			"title": "Learn to Learn to Program",
			"link": "http://static.danrschlosser.com/learn-to-learn-to-program.pdf",
			"description": "<p>Learning to program can be intimidating.  This talk attempts to outline everything you need to do and know in order to learn to program.</p>"
		},
		{
			"title": "An Accelerated Introduction to Web Development",
			"link": "http://old.adicu.com/intro-webdev",
			"description": "<p>This talk walks through all of the steps to learning to build your first web application.  It covers Python, Flask, APIs, HTML, and CSS.</p>"
		},
		{
			"title": "When &ldquo;Awesome&rdquo; is Isolating",
			"link": "http://static.danrschlosser.com/hackcon.pdf",
			"description": "<p>Too often, hackathon organizers focus on making their events &ldquo;awesome&rdquo;.  However, this often results in losing sight of how to attract new members, grow our communities, and focus on learning.  DevFest, Columbia's week-long workshop series and hackathon focus on education, community, and building.  I gave this talk at <a href=\"http://hackcon.io\">HackCon</a> in February, 2014.</p>"
		},
		{
			"title": "Making Windows Work",
			"link": "http://static.danrschlosser.com/making-windows-work/",
			"description": "<p>Tired of people making fun of you for using Windows? Come on down to learn how to put the &ldquo;Win&rdquo; back in &ldquo;Windows&rdquo;! Get the spark back, with cool tips and tricks that\"ll wonder how you ever lived without!<p><p>Learn how to:<p><ul><li>Develop and Collaborate effectively</li><li>Manage without a package manager</li><li>Command Prompt like a pro</li><li>Multitask with ease Bring your laptops!</li></ul>"
		},
		{
			"title": "The Power of Video Game Design",
			"link": "http://prezi.com/pwgh25hftgej/?utm_campaign=share&utm_medium=copy&rc=ex0share",
			"description": "<p>The traditional discussion of the role of video games in our culture is misguided. Can we think about video games differently?</p><p>This talk was influenced by Jane McGonigal's book Reality Is Broken.</p>"
		}
	]
}